---
kind: type
id: T:Autodesk.Revit.DB.ReferenceBaseOnHostType
source: html/13a3d927-757f-651a-0729-cf0307759851.htm
---
# Autodesk.Revit.DB.ReferenceBaseOnHostType

This enumeration is used to classify the Reference Base on Host type .

## Syntax (C#)
```csharp
public enum ReferenceBaseOnHostType
```